from PyQt5.QtWebEngineWidgets import QWebEngineView 
from pyowm.utils.config import get_default_config
from PyQt5.QtGui import QImage, QPixmap
from pyowm.utils import timestamps
from pyowm.utils import config
from PyQt5.QtWidgets import *
from PyQt5.QtCore import QUrl
from PyQt5.QtCore import Qt
from pyowm import OWM
from gtts import gTTS
import webbrowser
import threading
import playsound
import tempfile
import openai
import json
import fitz
import csv 

# Якщо у програму виникають проблеми при запуску чи роботі програми, 
# спробуйте вписати свій код від openAI-API, або OpenWeatherMap
openai.api_key = "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"
owm = OWM('c4bb700a457b50d5c8702a4cb696837b')

SETTINGS_LIST_ITEMS = [ # Список елементів налаштувань
    ('QCheckBox','Озвучування тексту бота'),
    ('QCheckBox','Світла тема'),
    ('QLineEdit','Місто проживання'),
]

SETTINGS_FILE = 'data/settings.json'

# Встановлення місця розташування
config_dict = get_default_config()
config_dict['language'] = 'ua'

# Усі області та основні міста України
ukraine_regions = {
    'Київська область': {
        'Київ',
        'Бровари',
        'Вишневе',
        'Васильків',
        'Ірпінь',
        'Бориспіль',
    },
    'Вінницька область': {
        'Вінниця',
        'Жмеринка',
        'Козятин',
        'Могилів-Подільський',
        'Бар',
        'Гайсин',
    },
    'Волинська область': {
        'Луцьк',
        'Ковель',
        'Нововолинськ',
        'Володимир-Волинський',
        'Камінь-Каширський',
        'Рожище',
    },
    'Дніпропетровська область': {
        'Дніпро',
        'Нікополь',
        'Кривий Ріг',
        'Павлоград',
        'Дніпрорудне',
        'Кам\'янське',
    },
    'Донецька область': {
        'Донецьк',
        'Маріуполь',
        'Макіївка',
        'Горлівка',
        'Краматорськ',
        'Слов\'янськ',
    },
    'Житомирська область': {
        'Житомир',
        'Малин',
        'Бердичів',
        'Новоград-Волинський',
        'Коростень',
        'Радомишль',
    },
    'Закарпатська область': {
        'Ужгород',
        'Мукачево',
        'Хуст',
        'Берегово',
        'Виноградів',
        'Свалява',
    },
    'Запорізька область': {
        'Запоріжжя',
        'Мелітополь',
        'Бердянськ',
        'Приморськ',
        'Енергодар',
        'Василівка',
    },
    'Івано-Франківська область': {
        'Івано-Франківськ',
        'Коломия',
        'Богородчани',
        'Калуш',
        'Долина',
        'Косів',
    },
    'Кіровоградська область': {
        'Кропивницький',
        'Олександрія',
        'Світловодськ',
        'Знам\'янка',
        'Новомиргород',
        'Новоархангельськ',
    },
    'Крим': {
        'Сімферополь',
        'Ялта',
        'Евпаторія',
        'Керч',
        'Феодосія',
        'Алушта',
    },
    'Луганська область': {
        'Луганськ',
        'Алчевськ',
        'Старобільськ',
        'Антрацит',
        'Брянка',
        'Красний Луч',
    },
    'Львівська область': {
        'Львів',
        'Дрогобич',
        'Самбір',
        'Стрий',
        'Борислав',
        'Червоноград',
    },
    'Миколаївська область': {
        'Миколаїв',
        'Південне',
        'Южноукраїнськ',
        'Вознесенськ',
        'Нова Одеса',
        'Снігурівка',
    },
    'Одеська область': {
        'Одеса',
        'Ізмаїл',
        'Білгород-Дністровський',
        'Котовськ',
        'Южне',
        'Роздільна',
    },
    'Полтавська область': {
        'Полтава',
        'Кременчук',
        'Миргород',
        'Лубни',
        'Гадяч',
        'Кобеляки',
    },
    'Рівненська область': {
        'Рівне',
        'Острог',
        'Кузнецовськ',
        'Дубно',
        'Здолбунів',
        'Сарни',
    },
    'Сумська область': {
        'Суми',
        'Охтирка',
        'Шостка',
        'Ромни',
        'Конотоп',
        'Лебедин',
    },
    'Тернопільська область': {
        'Тернопіль',
        'Бережани',
        'Чортків',
        'Збараж',
        'Бучач',
        'Кременець',
    },
    'Харківська область': {
        'Харків',
        'Ізюм',
        'Чугуїв',
        'Лозова',
        'Первомайський',
        'Балаклія',
    },
    'Херсонська область': {
        'Херсон',
        'Нова Каховка',
        'Каховка',
        'Скадовськ',
        'Гола Пристань',
        'Олешки',
    },
    'Хмельницька область': {
        'Хмельницький',
        'Кам\'янець-Подільський',
        'Шепетівка',
        'Славута',
        'Старокостянтинів',
        'Нетішин',
    },
    'Черкаська область': {
        'Черкаси',
        'Умань',
        'Золотоноша',
        'Канів',
        'Сміла',
        'Жашків',
    },
    'Чернівецька область': {
        'Чернівці',
        'Новоселиця',
        'Вашківці',
        'Сокиряни',
        'Кіцмань',
        'Герца',
    },
    'Чернігівська область': {
        'Чернігів',
        'Ніжин',
        'Прилуки',
        'Бахмач',
        'Сновськ',
        'Новгород-Сіверський',
    }
}